### Bibliotecas usadas

In [1]:
# Importa pandas e json 
import pandas as pd 
import json

### Criando JSON de exemplo

In [2]:
# Criando Dicionário Chave - valor, atribuindo a variável data 
data = { 
  "ID":["1","2","3","4","5","6","7","8" ],
  "Nome":["Antonio","Maria","Eric","Emily","Joao","Valentina","Erica","Messias"],
  "Salario":["623.3","515.2","611","729","843.25","578","632.8","722.5"],
  "Data_Inicio":["1/1/2012","9/23/2013","11/15/2014","5/11/2014","3/27/2015","5/21/2013",
  "7/30/2013","6/17/2014"],
  "Departamento":["TI","Operacoes","TI","RH","Financas","TI","Operacoes","Financas"]
}

### Escrevendo o arquivo em disco

In [3]:
# Escreve na memória o arquivo data.json
# Como abertura de arquivo persiste o dado  
with open("data.json", "w") as out:  
    json.dump(data,out)

### Lendo o arquivo com Pandas

In [4]:
# Leitura do arquivo com pandas 
# necessário saber caminho do arquivo no diretório 
dados = pd.read_json("data.json")
# Exibe resultado 
display(dados)

   ID       Nome  Salario Data_Inicio Departamento
0   1    Antonio   623.30    1/1/2012           TI
1   2      Maria   515.20   9/23/2013    Operacoes
2   3       Eric   611.00  11/15/2014           TI
3   4      Emily   729.00   5/11/2014           RH
4   5       Joao   843.25   3/27/2015     Financas
5   6  Valentina   578.00   5/21/2013           TI
6   7      Erica   632.80   7/30/2013    Operacoes
7   8    Messias   722.50   6/17/2014     Financas

### Lendo arquivo JSON como registros

In [5]:
# Função Pandas to_json Transforma o arquivo em registros json 
dados.to_json(orient='records', lines=True)

'{"ID":1,"Nome":"Antonio","Salario":623.3,"Data_Inicio":"1\\/1\\/2012","Departamento":"TI"}\n{"ID":2,"Nome":"Maria","Salario":515.2,"Data_Inicio":"9\\/23\\/2013","Departamento":"Operacoes"}\n{"ID":3,"Nome":"Eric","Salario":611.0,"Data_Inicio":"11\\/15\\/2014","Departamento":"TI"}\n{"ID":4,"Nome":"Emily","Salario":729.0,"Data_Inicio":"5\\/11\\/2014","Departamento":"RH"}\n{"ID":5,"Nome":"Joao","Salario":843.25,"Data_Inicio":"3\\/27\\/2015","Departamento":"Financas"}\n{"ID":6,"Nome":"Valentina","Salario":578.0,"Data_Inicio":"5\\/21\\/2013","Departamento":"TI"}\n{"ID":7,"Nome":"Erica","Salario":632.8,"Data_Inicio":"7\\/30\\/2013","Departamento":"Operacoes"}\n{"ID":8,"Nome":"Messias","Salario":722.5,"Data_Inicio":"6\\/17\\/2014","Departamento":"Financas"}'

### Leitura de colunas e linhas específicas

In [6]:
# Linhas 1,3,5 colunas Salario e Nome 
dados.loc[[1,3,5],['Salario','Nome']]

   Salario       Nome
1    515.2      Maria
3    729.0      Emily
5    578.0  Valentina

### Agrupamento de dados

In [7]:
# Agrupa os dados por determinado filtro  com a função Groupby do Pandas
# Resulta na soma dos Salários por departamento
dados.groupby(by="Departamento")['Salario'].sum().to_frame()

              Salario
Departamento
Financas      1565.75
Operacoes     1148.00
RH             729.00
TI            1812.30